{
    "home": "Home",
    "about": "About",
    "skills": "Skills",
    "work": "Work",
    "qualification": "Qualification",
    "services": "Services",
    "hi": "Hi,",
    "im": "I'm ",
    "downloadCV": "Download My CV",
    "aboutMe": "About Me",
    "whoIsDjalil": "Who's Djalil?",
    "aboutDjalil": "Abdel Djalil Hadj Habib is a dedicated Full Stack Developer with a strong focus on using advanced frameworks like Laravel, VueJS, and ReactJS to build efficient and innovative web applications. His deep understanding of the end-to-end web development process, from design to deployment, enables him to tackle complex problems and deliver highly intuitive and engaging user experiences. Committed to continual learning and evolution, Djalil's adaptability and problem-solving skills make him a vital asset in the fast-paced world of web development. Outside of work, Djalil loves exploring new technologies, refining his skills, and contributing to open-source projects.",
    "educationExperience": "Education & Experience",
    "educationTitle": "My Education",
    "informationSystemsEngineer": "Information Systems Engineer",
    "cesiExiaSchool": "CESI Exia School",
    "completedProgram": "Completed a comprehensive program in Information Systems Engineering at CESI Exia School, focusing on various aspects of software development, database management, and system architecture.",
    "developerDiploma": "Developer in Information Systems Diploma",
    "obtainedDiploma": "Obtained a Developer in Information Systems Diploma from CESI Exia School, gaining practical knowledge and skills in web development, programming languages, and software engineering principles.",
    "analystProgrammerDiploma": "Analyst Programmer Diploma",
    "attainedDiploma": "Attained an Analyst Programmer Diploma from CESI Exia School, specializing in analyzing complex programming problems, designing efficient algorithms, and implementing software solutions.",
    "mouloudKacemHighSchool": "Mouloud Kacem High School",
    "scientificBaccalaureate": "Scientific Baccalaureate",
    "completedHighSchool": "Completed my high school education at Mouloud Kacem High School, specializing in the scientific track, with a focus on mathematics, physics, and computer science.",
    "experienceTitle": "My Experience",
    "internshipInformationSystemsEngineer": "Internship - Information Systems Engineer",
    "InformationSystemsEngineer": "Full Stack Developer",
    "biteyeYear": "2023 - Present",
    "workBiteye": "Responsible for the complete development of mobile and web solutions, from database design to UI design and programming, ensuring smooth execution from A to Z.",
    "biteye": "Biteye",
    "internshipDuration1": "January - June 2023",
    "managedProject": "Successfully managed a project while simultaneously developing a web application.",
    "internshipMobileApplicationDeveloper": "Internship - Mobile Application Developer Intern",
    "kartlive": "Kartlive",
    "internshipDuration2": "July 2021 - February 2022",
    "designedImplementedApp": "Designed and implemented a mobile application improving user interaction and overall experience.",
    "internshipWebDevelopment": "Internship - Web Development Intern",
    "ustomb": "USTOMB",
    "internshipDuration3": "January - April 2021",
    "builtNewWebsite": "Effectively built a new website for the faculty, enhancing accessibility and user engagement.",
    "internshipAnalystProgrammer": "Internship - Analyst Programmer",
    "universityHospitalOran": "University Hospital of Oran",
    "internshipDuration4": "April - June 2020",
    "conductedWebDevelopment": "Conducted web development and maintenance, increasing site efficiency and usability.",
    "skillsTitle": "Skills",
    "professionalSkillsSubtitle": "Professional Skills",
    "professionalSkillsText": "As a dedicated Full Stack Developer, I bring along robust problem-solving skills and a keen eye for UI/UX design. Proficient in Laravel, VueJS, and ReactJS, I have a proven record of delivering high-performance web solutions.",
    "laravel": "Laravel",
    "vuejs": "VueJS",
    "reactjs": "ReactJS",
    "nodejs": "NodeJS",
    "laravelPercentage": "95%",
    "vuejsPercentage": "95%",
    "reactjsPercentage": "75%",
    "nodejsPercentage": "95%",
    "servicesTitle": "Services",
    "hireMe": "Hire Me",
    "apiDevelopmentTitle": "API Development",
    "apiDevelopmentDescription": "Expert in crafting custom and integrated APIs, ensuring scalability and robustness for versatile web applications.",
    "uxUiDesignTitle": "Intuitive UX/UI Design",
    "uxUiDesignDescription": "Crafting captivating, user-centric designs that ensure seamless user experiences and maximize customer retention.",
    "fullStackMasteryTitle": "Full Stack Mastery",
    "fullStackMasteryDescription": "Leveraging a diverse technology stack to deliver end-to-end solutions, from backend logic to frontend interactivity.",
    "performanceOptimizationTitle": "Performance Optimization",
    "performanceOptimizationDescription": "Utilizing advanced optimization techniques to ensure rapid load times, improved SEO, and enhanced user satisfaction.",
    "projectsTitle": "Projects",
    "comingSoon": "Take a look at my GitHub repository !",
    "BackendDeveloper": "Backend Developer",
    "dzConseil": "DZ Conseil",
    "dzConseilYear": "September 2024 - Present",
    "workDzConseil": "Design and optimization of enterprise management modules (replacements, absences, workloads), enhancing efficiency and tool reliability. Implementation of a budget management system reducing errors and facilitating decision-making."




}
