{
    "home": "Accueil",
    "about": "À propos",
    "skills": "Compétences",
    "work": "Projets",
    "qualification": "Qualification",
    "services": "Services",
    "hi": "Bonjour,",
    "im": "Je suis ",
    "downloadCV": "Télécharger mon CV",
    "aboutMe": "À propos de moi",
    "whoIsDjalil": "Qui est Djalil ?",
    "aboutDjalil": "Abdel Djalil Hadj Habib est un développeur Full Stack dévoué avec une forte orientation vers l'utilisation de frameworks avancés tels que Laravel, VueJS et ReactJS pour construire des applications web efficaces et innovantes. Sa compréhension approfondie du processus de développement web de bout en bout, de la conception au déploiement, lui permet de résoudre des problèmes complexes et de fournir des expériences utilisateur intuitives et captivantes. Engagé dans l'apprentissage continu et l'évolution, l'adaptabilité et les compétences en résolution de problèmes de Djalil en font un atout vital dans le monde rapide du développement web. En dehors du travail, Djalil aime explorer de nouvelles technologies, perfectionner ses compétences et contribuer à des projets open-source.",
    "educationExperience": "Formation et Expérience",
    "educationTitle": "Ma Formation",
    "informationSystemsEngineer": "Ingénieur en Systèmes d'Information",
    "cesiExiaSchool": "École CESI Exia",
    "completedProgram": "A suivi un programme complet en Ingénierie des Systèmes d'Information à l'École CESI Exia, en se concentrant sur différents aspects du développement logiciel, de la gestion de bases de données et de l'architecture système.",
    "developerDiploma": "Diplôme de Développeur en Systèmes d'Information",
    "obtainedDiploma": "A obtenu un diplôme de Développeur en Systèmes d'Information de l'École CESI Exia, acquérant des connaissances et compétences pratiques en développement web, langages de programmation et principes de génie logiciel.",
    "analystProgrammerDiploma": "Diplôme de Programmeur Analyste",
    "attainedDiploma": "A obtenu un diplôme de Programmeur Analyste de l'École CESI Exia, se spécialisant dans l'analyse de problèmes de programmation complexes, la conception d'algorithmes efficaces et la mise en œuvre de solutions logicielles.",
    "mouloudKacemHighSchool": "Lycée Mouloud Kacem",
    "scientificBaccalaureate": "Baccalauréat Scientifique",
    "completedHighSchool": "A terminé ses études secondaires au Lycée Mouloud Kacem, se spécialisant dans la filière scientifique, avec un accent sur les mathématiques, la physique et l'informatique.",
    "experienceTitle": "Mon Expérience",
    "internshipInformationSystemsEngineer": "Stage - Ingénieur en Systèmes d'Information",
    "InformationSystemsEngineer": "Développeur Full Stack",
    "biteyeYear": "2023 - Maintenant",
    "workBiteye": "Responsable du développement complet de solutions mobiles et web, depuis la conception de la base de données jusqu'au design et à la programmation, garantissant une exécution fluide de A à Z.",
    "biteye": "Biteye",
    "internshipDuration1": "Janvier - Juin 2023",
    "managedProject": "Géré avec succès un projet tout en développant simultanément une application web.",
    "internshipMobileApplicationDeveloper": "Stage - Stagiaire Développeur d'Applications Mobiles",
    "kartlive": "Kartlive",
    "internshipDuration2": "Juillet 2021 - Février 2022",
    "designedImplementedApp": "Conçu et mis en œuvre une application mobile améliorant l'interaction et l'expérience utilisateur.",
    "internshipWebDevelopment": "Stage - Stagiaire en Développement Web",
    "ustomb": "USTOMB",
    "internshipDuration3": "Janvier - Avril 2021",
    "builtNewWebsite": "Construit efficacement un nouveau site web pour la faculté, améliorant l'accessibilité et l'engagement des utilisateurs.",
    "internshipAnalystProgrammer": "Stage - Programmeur Analyste",
    "universityHospitalOran": "Hôpital Universitaire d'Oran",
    "internshipDuration4": "Avril - Juin 2020",
    "conductedWebDevelopment": "Réalisé le développement et la maintenance de sites web, augmentant l'efficacité et la convivialité du site.",
    "skillsTitle": "Compétences",
    "professionalSkillsSubtitle": "Compétences Professionnelles",
    "professionalSkillsText": "En tant que développeur Full Stack dévoué, je dispose de solides compétences en résolution de problèmes et d'un œil attentif pour la conception UI/UX. Maîtrisant Laravel, VueJS et ReactJS, j'ai un bilan avéré dans la réalisation de solutions web performantes.",
    "laravel": "Laravel",
    "vuejs": "VueJS",
    "reactjs": "ReactJS",
    "nodejs": "NodeJS",
    "laravelPercentage": "95%",
    "vuejsPercentage": "95%",
    "reactjsPercentage": "75%",
    "nodejsPercentage": "95%",
    "servicesTitle": "Services",
    "hireMe": "Engagez-moi",
    "apiDevelopmentTitle": "Développement d'API",
    "apiDevelopmentDescription": "Expert dans la création d'API personnalisées et intégrées, garantissant la scalabilité et la robustesse des applications web polyvalentes.",
    "uxUiDesignTitle": "Conception UX/UI intuitive",
    "uxUiDesignDescription": "Conception de designs captivants et centrés sur l'utilisateur, garantissant des expériences utilisateur fluides et maximisant la fidélisation des clients.",
    "fullStackMasteryTitle": "Maîtrise Full Stack",
    "fullStackMasteryDescription": "Exploitation d'une pile technologique diversifiée pour fournir des solutions de bout en bout, de la logique backend à l'interactivité frontend.",
    "performanceOptimizationTitle": "Optimisation des performances",
    "performanceOptimizationDescription": "Utilisation de techniques d'optimisation avancées pour assurer des temps de chargement rapides, une meilleure optimisation pour les moteurs de recherche et une satisfaction utilisateur améliorée.",
    "projectsTitle": "Projets",
    "comingSoon": "Jette un coup d'œil à mon dépôt GitHub !",
    "BackendDeveloper": "Développeur Backend",
    "dzConseil": "DZ Conseil",
    "dzConseilYear": "Septembre 2024 - Présent",
    "workDzConseil": "Conception et optimisation de modules de gestion d’entreprise (remplacements, absences, charges), améliorant l’efficacité et la fiabilité des outils. Implémentation d’un système de gestion budgétaire réduisant les erreurs et facilitant la prise de décision."









}
